Verified **fixed** on harvester-terraform provider `master` with Harvester `v1.1.1`. Close this issue.

### Result
1. We can set `route_mode = "auto"` and also specify the `route_dhcp_server_ip` to apply the network resource correctly. 
  (Use v1.1.0 cluster network feature)
  ```
  resource "harvester_network" "mgmt-vlan1" {
    name      = "mgmt-vlan1"
    namespace = "default"
    description = ""
  
    vlan_id = 1
  
    route_mode           = "auto"
    route_dhcp_server_ip = "192.168.122.1"
  
    cluster_network_name = "mgmt"
  }
  ```
![image](https://user-images.githubusercontent.com/29251855/207499278-8aa402d2-5274-4186-af70-d52ae04df109.png)

2. And we can also edit the description and apply again 

  ```
  c0e03db26271:/data # terraform apply -auto-approve
  harvester_network.mgmt-vlan1: Refreshing state... [id=default/mgmt-vlan1]
  
  Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
    ~ update in-place
  
  Terraform will perform the following actions:
  
    # harvester_network.mgmt-vlan1 will be updated in-place
    ~ resource "harvester_network" "mgmt-vlan1" {
        + description          = "test"
          id                   = "default/mgmt-vlan1"
          name                 = "mgmt-vlan1"
          tags                 = {}
          # (6 unchanged attributes hidden)
      }
  
  Plan: 0 to add, 1 to change, 0 to destroy.
  harvester_network.mgmt-vlan1: Modifying... [id=default/mgmt-vlan1]
  harvester_network.mgmt-vlan1: Modifications complete after 1s [id=default/mgmt-vlan1]
  
  Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
  
  ```
  ![image](https://user-images.githubusercontent.com/29251855/207786372-d00f5185-044e-4a59-a0aa-0c2305b3b91f.png)

### Test Information
* Test Environment: 1 node harvester on local kvm machine
* Harvester version: v1.1.1
* Terraform version: master 

### Verify Steps
1. Prepare Harvester cluster 
2. ssh to Harvester and get kubeconfig content in `/etc/rancher/rke2/rke2.yaml` 
3. Copy the content to host machine ~/.kube/config 
4. Update the `server:` to harvester management ip
5. Run the following command to startup a terraform-provider container 
  ```
  docker pull rancher/terraform-provider-harvester:master-head-amd64
  docker rm -f terraform-provider-harvester-master-head
  docker run -itd --name terraform-provider-harvester-master-head rancher/terraform-provider-harvester:master-head-amd64 bash
  docker cp ~/.kube/config terraform-provider-harvester-master-head:/tmp/kubeconfig
  docker exec -it terraform-provider-harvester-master-head bash
  ```
6. (optional) install kubectl on terraform-provider container follow the [instruction](https://kubernetes.io/docs/tasks/tools/install-kubectl-linux/)

7. Check the connectivity to Harvester cluster 
  ```
  kubectl --kubeconfig=/tmp/kubeconfig get no
  ```
8. vim `providers.tf` , add the following content 
  ```
  terraform {
    required_providers {
      harvester = {
        source = "harvester/harvester"
        version = "0.0.0-master"
      }
    }
  }
  
  provider "harvester" {
    kubeconfig = "/tmp/kubeconfig"
  }
  ```
9. Run `terraform init` to initialize it.
10. Create a test config file `vim main.tf`
11. Add resource harvester_network with route_mode = "auto" and route_dhcp_server_ip = "<replace to your dhcp server>"

  ```
  resource "harvester_network" "mgmt-vlan1" {
    name      = "mgmt-vlan1"
    namespace = "default"
    description = ""
  
    vlan_id = 1
  
    route_mode           = "auto"
    route_dhcp_server_ip = "192.168.122.1"
  
    cluster_network_name = "mgmt"
  }
  
  ```
12. Apply the resource `terraform apply -auto-approve` 
  ```
  c0e03db26271:/data # terraform apply -auto-approve
  
  Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
    + create
  
  Terraform will perform the following actions:
  
    # harvester_network.mgmt-vlan1 will be created
    + resource "harvester_network" "mgmt-vlan1" {
        + cluster_network_name = "mgmt"
        + config               = (known after apply)
        + id                   = (known after apply)
        + message              = (known after apply)
        + name                 = "mgmt-vlan1"
        + namespace            = "default"
        + route_cidr           = (known after apply)
        + route_connectivity   = (known after apply)
        + route_dhcp_server_ip = "192.168.122.1"
        + route_gateway        = (known after apply)
        + route_mode           = "auto"
        + state                = (known after apply)
        + vlan_id              = 1
      }
  
  Plan: 1 to add, 0 to change, 0 to destroy.
  harvester_network.mgmt-vlan1: Creating...
  harvester_network.mgmt-vlan1: Creation complete after 1s [id=default/mgmt-vlan1]
  
  Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
  ```
13. Edit the main.tf, update the description 
14. Apply the resource again `terraform apply -auto-approve` 




